src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ЦенообразованиеСервер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Цены номенклатуры: получение действующих цен и заполнение цен и сумм в документах.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает действующие на дату цены номенклатуры (срез последних регистра ЦеныНоменклатуры).
//
// Параметры:
//  СписокНоменклатуры - Массив из СправочникСсылка.Номенклатура - для каких позиций нужны цены.
//  Дата - Дата - дата, на которую действует цена; пустая дата - последние установленные цены.
//
// Возвращаемое значение:
//  Соответствие - ключ: СправочникСсылка.Номенклатура, значение: Число (цена).
//                 Позиций без установленной цены в соответствии нет.
//
Функция ЦеныНоменклатуры(СписокНоменклатуры, Дата) Экспорт

	Цены = Новый Соответствие;
	Если СписокНоменклатуры.Количество() = 0 Тогда
		Возврат Цены;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатуры.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, Номенклатура В (&СписокНоменклатуры)) КАК ЦеныНоменклатуры";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Цены.Вставить(Выборка.Номенклатура, Выборка.Цена);
	КонецЦикла;

	Возврат Цены;

КонецФункции

// Заполняет незаполненные цены в табличной части Товары по действующему прайсу,
// пересчитывает суммы строк (Количество * Цена) и итоговую сумму документа.
// Вызывается перед записью документов, у которых есть колонки Цена и Сумма.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - документ с табличной частью Товары и реквизитом СуммаДокумента.
//
Процедура ЗаполнитьЦеныИПересчитатьСуммы(ДокументОбъект) Экспорт

	БезЦены = Новый Массив;
	Для Каждого СтрокаТоваров Из ДокументОбъект.Товары Цикл
		Если СтрокаТоваров.Цена = 0 И ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
			БезЦены.Добавить(СтрокаТоваров.Номенклатура);
		КонецЕсли;
	КонецЦикла;

	Цены = ЦеныНоменклатуры(БезЦены, ДокументОбъект.Дата);

	Для Каждого СтрокаТоваров Из ДокументОбъект.Товары Цикл
		Если СтрокаТоваров.Цена = 0 Тогда
			Цена = Цены.Получить(СтрокаТоваров.Номенклатура);
			Если Цена <> Неопределено Тогда
				СтрокаТоваров.Цена = Цена;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ПересчитатьСуммы(ДокументОбъект);

КонецПроцедуры

// Пересчитывает суммы строк табличной части Товары (Количество * Цена) и итог документа.
// Цены не меняет - используется для документов поступления, где цена закупочная.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - документ с табличной частью Товары и реквизитом СуммаДокумента.
//
Процедура ПересчитатьСуммы(ДокументОбъект) Экспорт

	Для Каждого СтрокаТоваров Из ДокументОбъект.Товары Цикл
		СтрокаТоваров.Сумма = Окр(СтрокаТоваров.Количество * СтрокаТоваров.Цена, 2);
	КонецЦикла;

	ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("Сумма");

КонецПроцедуры

#КонецОбласти
